Tekla.Structures.ModuleManager.Modules.Cache.MultimaterialModeling
Indicates whether the multimaterial modeling is enabled.

Tekla.Structures.ModuleManager.Modules.Cache.LoadModeling
Indicates whether the load modeling is enabled.

Tekla.Structures.ModuleManager.Modules.Cache.SteelDetailing
Indicates whether the steel detailing is enabled.

Tekla.Structures.ModuleManager.Modules.Cache.ConcreteDetailing
Indicates whether the concrete detailing is enabled.

Tekla.Structures.ModuleManager.Modules.Cache.RebarModeling
Indicates whether the rebar modeling is enabled.

Tekla.Structures.ModuleManager.Modules.Cache.CIPModeling
Indicates whether the CIP modeling is enabled.

Tekla.Structures.ModuleManager.Modules.Cache.AnalysisAndDesign
Indicates whether the Analysis and Design management is enabled.

Tekla.Structures.ModuleManager.Modules.Cache.TaskManagement
Indicates whether the task management is enabled.